{"podcast_details": {"podcast_title": "Disney Movie Insiders Presents", "episode_title": "Hailey's On It!", "episode_image": "https://megaphone.imgix.net/podcasts/c2b6130a-4fa0-11eb-89c9-4b8ed7ab0a00/image/uploads_2F1609944775525-y8i0iopw08g-4d7a69fcb675f626e0355fad7c589392_2F3000x3000_B.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Hi, insiders! It's Lisa, back to give you an insider's look at the new comedy adventure, Haley's On It. The series follows Haley Banks, a risk-averse but resourceful teenager on a mission to complete every item on her long list of challenging and sometimes impractical tasks in order to save the world. You know, things like winning a sand building competition or wrestling a honey badger. This series definitely has a lot of fun and plenty to do. One list to save the world, you better believe Haley's On It. Today we're talking to the show's creators and executive producers, Devin Bungee and Nick Stanton. Welcome you two! Hello, we're super excited to be here. Thanks so much for having us, Lisa. Thanks Nick and thanks Devin. Okay, so we want to get to know you. Tell us about yourselves and then how you got going in your careers. Let's say Devin, let's start with you. Sure. My name is Devin Bungee and I actually met Nick at the USC Film School. We were both in the same screenwriting program together as undergrads and we both kind of bonded. We came from small snowy climates. I grew up in Northern California in the foothills up towards Tahoe and Nick came from Minnesota. So we sort of bonded over our love of silly comedies and wanting to make jokes. So that's sort of where we met and shortly after school we started writing together and we've been doing it ever since. Nick, what do you have to add to that? Yeah, we got our start at Disney and a couple little shows at TVA, Emperor's New School and the replacements and then we've been working together ever since and Zeke and Luther and then we created a couple shows and are very excited now with Haley's on it. This is our first animated show that we've created. So it's very exciting. That's so, so cool. Well, I've got to say though, what a cool story. You're from different, totally different climates, but it's like you came together and were able to figure out just a great, wonderful working relationship. I love that you met in college and then here we are, as you said, projects later and here is Haley's on it. So, okay, how does this project come about? Like you guys have already had a few different projects together. Tell us how this one got started. Yeah, I can take this one. So we were in a development deal at Disney and we were kicking around ideas and it started with a very small idea. It was like, what if there was something like with almost like Seinfeld level stakes, right? Like we had this idea of a list, right? The girl, regular girl, 14 year old girl, maybe she has a little bit of trouble getting outside of herself, but she's got this list of things that she wants to do, these big things she wants to do in life. And what if that had a world altering effects, right? Like these little, you know, spend all your old gift cards, right? But, you know, it turns out that, you know, her list eventually will be the first step toward her doing these great big things. So we're both fans of movies like Bill and Ted's Excellent Adventure, right? It's just like two regular kids, but you know, their actions passing that history test had, you know, future ramifications. And I don't know, we just thought that was kind of a funny idea. And so we built a world around it and characters and, you know, wrote a pilot script. And it was just really well received. It just kind of just flowed very naturally. So it was very organic. There seems to just be a lot of comedy when you have huge stakes with small, small goals to throw on. We also like, you know, another one of the inspirations that we always did love shows and movies where ordinary characters are thrown into like these really crazy circumstances like Bill and Ted's Futurama, Back to the Future Terminator 2, even though it's not comedy. You know, like, I don't know, there's just something very cool and appealing about, you know, sort of regular people being thrust into these kind of crazy scenarios. It's so true when you're a kid, right? These moments, you're matching the moment with these with the series. Like, it's everything can seem so big to someone. And then you're like, OK, perspective. But this I love how you match the moment of a kid's life and how you create these really fun, high stakes situations. It's so cool. But tell us about the music. That's something that really stands out in this series. Yeah. I mean, we we've always loved music, comedy, musics, especially. And, you know, we had a little bit just kind of written into the pilot from the start. But then when we got Ali to be our lead, it was just a no brainer of the actually the biggest challenge was we had, you know, we had a character who's very hesitant and sort of in her own head about a lot of things. So very early on, we had to kind of come up with a way where she learned to be OK singing in public so that she could continue to do it more often than that probably would have, you know, as a from where the character started. So but yeah, and then Matthew Tishler and Andrew Underberg, who we who are our composers and songwriters are just incredibly talented guys who who totally hit our sensibilities, both comedy and song style wise. So we've just loved the sort of collaboration with them and Ali and all our cast, honestly, bringing in great, great stuff. So so cool. So tell us a little bit more about Haley, because obviously that's the star of our show here. So how did you know, like how the character was going to be shaved, how you wanted her to sound like, how did all those pieces of the puzzle come together? Yeah, it was, you know, the stars kind of aligned in terms of Ali. We started out, we wanted to do a character like Devin said, you know, it's just sort of a regular girl, a 14 year old girl, you know, who was destined for great things, but sort of had trouble getting outside of her own head and and things like that. And and, you know, we, you know, we were doing the pilot and that was right when the pandemic hit. And so, you know, we sort of had a limited pool of people to try out for the pilot. But then we heard Ali's audition and we didn't actually get her to do the recording for like several months later. But you know, when she did, we were wondering, well, you know, she's a Disney princess. That's great. She's got this great voice and, you know, she was she had a great audition. But like, can she hit the comedy? You know, Moana is not really a comedy. And so we had her in the booth to record some lines and immediately it was just, you know, obvious that she could, you know, she could do that and more. And, you know, the fact that she is this like amazing singer, like Devin said, that's sort of been baked into the the DNA of the show now. And yeah, it was it was it was just Kismet. Absolutely cool. Well, obviously, we're Disney podcasts. We love Ali'i Kravaya, because that is absolutely so cool how you're saying she is. She's a Disney princess with Moana, of course. Now, tell us about Scott, though. Yeah, Scott is Scott is Haley's best friend. They've grown up together their whole lives. And they're just well, they're interestingly, they're total opposites, but they also work out perfectly. You know, he she's a little scared to do anything. He does does everything without thinking twice. But they're you know, they're they work perfectly together. And, you know, sort of the thrust of the series is that she's sort of had these feelings for him that she's never mentioned. But, you know, now she's realizing maybe she's going to need to say something, you know, just because it's something that she wrote on her list. But Scott himself, he was played by Manny Hasinto, who, you know, is just literally one of the funniest people in the world. And he's also so unique, like he can bring things and just sounds and reactions and whatever that like literally no one else would do. He's he's a he's a total unicorn in both his skills and comedy and in performances. So we're we're super thrilled to have him because he's he's really just great, great character and playing out off of our league. It works great. Maybe it's great chemistry. That's so good. I love how you're saying how they checked all the boxes between the two of them. And you mentioned it there, Devin, this list. What can you tell us about Haley's list and what inspired the items on it? Yeah, honestly, just sort of us and the writers and we have an incredible staff of writers, you know, just we sort of try to think of anything and everything that a a a 14 year old would put on their list, you know, to, you know, challenge themselves. Oh, that'd be awesome. But I'll do it someday. Or I know I'm supposed to, but I'm not sure when or whatever. And it's it's literally everything from like Nick said, spend your old gift cards to teach a cat to play piano, you know, just like stuff that like you wouldn't necessarily guarantee you would do someday. But then when she finds out in the future, she actually did everything and it led her onto a path of greatness that, wow, I actually can do this and I will do this. And it's pretty inspiring, but also intimidating. And we just it puts her in a perfect spot of having to do things that she doesn't think she can, but she has to now in a way. That's so fun. So you have the story you have. Obviously, you have Haley, you have Scott stylistically. How do you determine what this looks like? Like, it looks really cool, obviously, visually. So what about that? Yeah. Well, thematically, we sort of wanted to make a world that was worth fighting for. That's sort of what the one of the themes of the of the show. And, you know, we really leaned on on our, you know, talented artist to really create that world. You know, how he Parkinson's is our supervising director and Leanne DeFour is our art director. And and, you know, like Devin said, we're both from like, you know, small towns and in snowy climates. And but we both as kids watched the same kind of shows and like, like Say By The Bell was both one of our favorite shows like that show. And I think it was because it was set by the beach and like everyone was like, you know, it was like sunny and happy. And so this series is set in Southern California, Oceanside. And, you know, we just wanted the world to just have a bright kind of sunny, beautiful look. I mean, that was really the only kind of edict that we gave to our artists. And they really just ran with that. And, you know, it's these these beautiful colors. We use a lot of primary colors, you know, and, you know, yeah, just just a fun world together. Devin and I weirdly just liked all the same like sort of after school animated shows to like the original DuckTales and things like that. And yeah, we like, you know, that that's so much. And a lot of it was the just the just the colors. It just looked like a beautiful, like happy world, I think. And so we just kind of took that gut feeling and ran with it. Yeah, I'll add in all the classic Disney shorts and stuff, too, like that. There's a reason that stuff's always so appealing. It's just the right fun world where you just want to spend time. That's how we work. So we wanted to bring that. I mean, you could totally do the show in a, you know, a scary future, you know, not nice place. But is that somewhere you want to spend a half hour of your day? I don't know. I don't think so. We'd rather do somewhere beautiful where you you can see the beach from your window. Well, and I think, too, we have to mention it's beautiful and it's fun. It's going to deserve a rewatch over and over because I hear that there's Easter eggs in here and there might be some related to the Avengers. What can you tell us about that? A little bit, a little bit of a nod. Yeah, we without spoiling too much, we do a sort of a, I guess, a comic con episode. You know, they're all both Haley and Scott and Beta, who's another one of our main characters, our big fans of this superhero franchise that, you know, is has characters like the silver jaguar and the the angry giant and futurism. And, you know, without spoiling too much, there's, you know, part of our show, there's a time traveling element and there's like portals and, you know, amazing things can come from the future. And and we thought, oh, wouldn't that be interesting and sort of a comic con kind of setting if if real, you know, real life superheroes and and, you know, cool stuff from the future showed up. So, yeah, we're really excited about that episode. It would be a really fun one. This is totally going to be a Disney fan favorite. I absolutely love everything that we're talking about here. So we know the fans are going to love this. What would you say is your favorite episode of the season? Good question. Yeah, I don't know. We we like so many of them. We really I really do like the pilot. I think that's a fun world where you get to meet the professor and she's one of the favorite characters. So I'd probably go with that one. Personally, Nick, I have a couple of favorites. There's well, there's an episode called The Wild, Wild Masts, which they visit an old western town, but then like a biker gang shows up because of something Scott did. And our board artists just like really made it, you know, big and ridiculous. And that was a really fun episode. OK, so one of the storylines that I think fans are going to want to know. And you don't have to tell us, but just, you know, one of the fans or some of the fans may want to know this. Will Haley ever kiss Scott? Hopefully we could watch a few seasons and find out. You know, we always saw this as as their relationship as kind of a Jim and Pam in the office kind of. So take that for what you will. You know, they I think on that show, they they did end up together. But we haven't, you know, we haven't crossed that bridge yet, so I don't know. Devon, what do you think? Yeah, I mean, in reality, the we know the future as it was supposed to be, where things ended up really good is when she completed every item on our list. So in Haley almost has the knowledge that at some point she did it. She doesn't know how she doesn't know why or when or what. But it was sort of in her. It was in her future path. But there's now challenges of can she maintain that? And there and there are sort of there's little teasers in the in the trailer and stuff of these these little bots that are being sent back to stop her from completing our list. So there is a challenge of of someone from the future trying to stop her from becoming the the great person that she's destined to be. So it's not a sure thing, but we are also big fans of of those kind of stories. So we're not we're not planning to pick off all our fans. I like it. You're like you have to wait and watch you. You're talking obviously about Haley's on it with this list. If you for yourself had your own list, what's on your list of stuff you always wanted to do? What would be something on there? I would just like to get the list done. We should be done with it now. Man, what is on my list? We have a lot of boring adult things, I think, on our list. It's usually stuff that we, you know, to do with our kids. But I would like to do an Iron Man triathlon someday. I think that would be nice. I'll say I'd like to finally get to all the other Disney theme parks. I've only ever been to parks. And and there's the Tokyo one looks so cool. And actually, no, I did not go to Paris. I think we almost went to Disney and Paris once. But anyway, I'd like to have the time and ability to go to all the parks. Definitely some things to look forward to for both of you. And actually, we want to know even more about both you, Nick and Devin. Are you ready to take on the inside or five with us? Oh, heck, yeah. Let's do it. OK, here we go with our first question. What is your earliest memory of being a Disney movie fan? I can go first. I distinctly remember it. It was Snow White was my first ever Disney movie. And yes, I don't remember much of it besides besides that. I remember the brightness of the the apple. And, you know, and that's stuck with me to this day. And I actually remember my mom. My mom, I was from small town in rural Minnesota. But our one big trip we took his kids was actually to Disneyland. And I get to meet all the Disney characters. I cried when I met Pluto. I don't know why, but loved all the Pluto. I don't know something about, you know, I was I was two or three or whatever. So you never know. You never know how it's going to go when you're two or three and who you meet that day and how you're going to feel. But those are some good memories, I got to say, Nick. OK, Devin, what about you? Weirdly, the first Disney movies I remember watching were like the Herbie, like card love bug. They were like live action movies. So like I have a weird early memories of those. But the first animated movie that I fell in love with was Aladdin. I just I love the story. I love the songs and, you know, Robin Williams was epic. So it was that was the first one I remember really falling in love with as a child. So, so good. OK, your next question. If you could only ride one ride all day at a Disney park, which would it be? Well, I wouldn't pick the teacups because I always get sick of that. Like a whole day of that would be too much. But I would have to say Peter Pan. That's that was my favorite. I even remember it as a kid back to your first question. And it still sticks with me. So I guess I would go with Peter Pan. That is lovely. Yeah. I've tried it all day. I don't think I can pick a thrill ride, even though I do love, you know, Space Mountain in those. I think I would go with pirates, I guess, because a little bit of thrill, a good show, good songs. And I always wanted to be a pirate. I love the strategy of both of you right there. There's a pirate and Peter Pan, too. You got Captain Hook in there. So look at you. That's for instance, college over here working together. Look at this connection we got. I do have to say that we're doing a short this season where that that's is themed after a Disney ride. And it's the Matterhorn. That's another favorite of mine. And and Haley and Scott have an adventure that has to do with all of the elements of the Matterhorn, which I wouldn't ride it all day. But it's another favorite ride. That's awesome. OK, we're excited about that. OK, your next question. It's Disney karaoke night. What song do you sing? Definitely something from Moana. That's if our show is not available. That's the thing that my daughter has listened to about 350 times. But yeah, well done. Anything and everything from Moana, I think. I would probably do. You've got a friend in me. My boys are big Toy Story fans. So that's a song about best friends, which is what Haley's on it is, too. So that's that's so good. I love those pics. Those are great. Your next question. You are invited to a Disney themed costume party. Who or what do you dress as? Good question. That's a good one. And we'd probably come together as Zeke and Luther, but coordinated looks. Those work, too. Yeah. The middle aged Zeke Luther. Gosh, I wonder if I could put together a good Phineas costume. Get a triangle head. Yeah, we wrote a couple of episodes of Phineas and Ferb. And my son is actually so maybe maybe I'd try and throw together a Phineas costume. OK, Nick, I see that. I see that. Devon, you got to change your answer. Yeah, I guess I would say just because on my mind, I'd probably go with Captain Jack Sparrow. Nice. You don't want to be a pirate. It's going to be hours of makeup right there. So you got to show us the video, the getting ready video. OK, and to close us out on the insider five, which Disney character has the best life advice and what is it? Good question. And also, it's just heads up. Haley's on it, of course, as a part of the Disney family. So if you want to toss it to your show, anything resonates there. Everything's included here in the Disney family. All right. Well, off the top of my head, I will say maybe Hakuna Matata is a good, you know, classic, love it. Philosophy. OK, that's that's what I'll go with. Nice, Nick. And I'll go back to our other show we created, Gamers Guide to Pretty Much Everything. Connor had a philosophy of, you know, gaming is life. So we like the idea of the spirit of fun should be something we all, you know, enjoy even at whatever stage in life you're at. And I think that's a good message. I love that so much. Well, thank you both so much for the time, for telling us. I love the beginning of your story. Then here we are with Haley's on it. It's been a true pleasure talking to you both and hearing even more about your Disney fandom. Thank you so much for joining us. Thank you, Lisa. This has been great. Thanks so much. Membership is required. Limit one redemption per account. Visit DisneyMovieInsiders.com for terms and conditions."}, "podcast_summary": "\"Lisa interviews the creators and executive producers of the new animated series Haley's On It. They discuss how they met, the inspiration for the show, the characters and their relationships, and the visual style of the series. They also hint at future storylines and Easter eggs, and share their favorite Disney memories and songs. Overall, it's a fun and insightful interview about the creation of Haley's On It and the Disney fandom of the creators.\"", "podcast_guest": "Devin Bungee", "podcast_highlights": "Key Takeaways from the Transcript:\n\n1. The series \"Haley's On It\" follows a risk-averse but resourceful teenager named Haley Banks who is on a mission to complete every item on her long list of challenging tasks to save the world.\n2. The show's creators and executive producers, Devin Bungee and Nick Stanton, met at USC Film School and bonded over their love of silly comedies and making jokes.\n3. The idea for the show came from the concept of a list with small goals having world-altering effects, similar to movies like \"Bill and Ted's Excellent Adventure.\"\n4. The show features music and songs, and the lead actress, Ali'i Kravaya, had to learn to be comfortable with singing in public for the role.\n5. The world of the show is bright, sunny, and beautiful, inspired by shows like \"Saved by the Bell\" and classic Disney shorts.\n6. There are Easter eggs in the show, including a nod to the Avengers in an episode centered around a comic con setting.\n7. The relationship between Haley and her best friend Scott is compared to Jim and Pam from \"The Office,\" and the possibility of them getting together is left open.\n8. The characters have a list of challenges and tasks to complete, which is inspired by things that a 14-year-old would put on their own list.\n9. The show's art style is designed to have a theme of a world worth fighting for and features primary colors and beautiful visuals.\n10. The creators mentioned their early memories of being Disney movie fans and shared their favorite Disney rides and songs.\n11. They also discussed their choices for a Disney-themed costume party and talked about the life advice they would take from Disney characters Hakuna Matata and the philosophy of fun from their previous show \"Gamer's Guide to Pretty Much Everything.\""}